prototype/high-fedility/app/controllers/application_controller.rb

    def correct_user?
      redirect_to landing_path unless current_user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]