prototype/high-fedility/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "post_id", "user_id", "commentable_id", "commentable_type", "ancestry", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @comment = @post.comments.build(comment_params)
    @comment.user = current_user
    @comment.post = @post
    if @comment.save

UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "How are we supposed to say \"Hello World\" with print()?"], ["updated_at", "2022-10-18 07:35:34.848562"], ["id", 2]]
---
  def update
    params[:comment][:parent_id] = @comment.parent_id
    if @comment.update(comment_params)

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]
---
  def destroy
    flash[:message] = "Comment has been deleted."
    @comment.destroy

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_comment
      if params[:id]
        @comment = Comment.find(params[:id])
      else
        @comment = Comment.find(params[:comment_id])

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def get_course
      @course = Course.find(params[:course_id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def get_post
      @post = Post.find(params[:post_id])