prototype/high-fedility/app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    if @course.save
---
INSERT INTO "courses" ("code", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["code", "qweqweqw"], ["name", "123123123"], ["created_at", "2022-05-20 05:21:58.159699"], ["updated_at", "2022-05-20 05:21:58.159699"]]

  def update
    if @course.update(course_params)
---
UPDATE "courses" SET "code" = $1, "name" = $2, "updated_at" = $3 WHERE "courses"."id" = $4  [["code", "CSSE2002"], ["name", "Programming in the Large"], ["updated_at", "2022-05-17 03:41:53.641253"], ["id", 5]]

  def destroy
    flash[:message] = "Course has been deleted."
    @course.destroy
---
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 1]]

  def enroll
    @course.toggle_enrollment(current_user)
---
UPDATE "users" SET "updated_at" = $1, "role" = $2, "register_code" = $3 WHERE "users"."id" = $4  [["updated_at", "2022-05-24 01:59:13.280261"], ["role", 3], ["register_code", "439671"], ["id", 2]]

  def set_course
    if params[:id]
      @course = Course.find(params[:id])
    else
      @course = Course.find(params[:course_id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]