prototype/high-fedility/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "course_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @post = @course.posts.build(post_params)
    @post.user = current_user

    if @post.save

UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "asdasdsd"], ["updated_at", "2022-05-24 02:03:30.552204"], ["id", 5]]
---
  def update
    if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 7]]
---
  def destroy
    flash[:message] = "Post has been deleted."
    @post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."course_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["course_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."course_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["course_id", 5], ["id", 7], ["LIMIT", 1]]
---
    def set_post
      if params[:id]
        @post = @course.posts.find(params[:id])
      else
        @post = @course.posts.find(params[:post_id])

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def get_course
      @course = Course.find(params[:course_id])