prototype/high-fedility/app/views/users/_user.haml

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."user_id" = $1  [["user_id", 4]]
---
%ul.list-group
  - user.enrollment.each do |enrollment|

SELECT "awards".* FROM "awards" WHERE "awards"."user_id" = $1  [["user_id", 4]]
---
%ul.list-group
  - user.awards.each do |award|