prototype/high-fedility/app/models/comment.rb

    def awards_to_s
        return "Trophies: #{self.awards.where(award_type: 1).count} | Medals: #{self.awards.where(award_type: 0).count}"
---
SELECT COUNT(*) FROM "awards" WHERE "awards"."comment_id" = $1 AND "awards"."award_type" = $2  [["comment_id", 19], ["award_type", 1]]

    def award_bool_to_s(user)
        if self.awards.find_by(backer: user).nil?
---
SELECT "awards".* FROM "awards" WHERE "awards"."comment_id" = $1 AND "awards"."backer_id" = $2 LIMIT $3  [["comment_id", 19], ["backer_id", 4], ["LIMIT", 1]]