prototype/high-fedility/app/models/course.rb

    def new_enrollment(user)
        enrollment = Enrollment.new
        enrollment.user = user
        enrollment.course = self
        enrollment.save
---
INSERT INTO "enrollments" ("user_id", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 4], ["course_id", 5], ["created_at", "2022-10-13 02:53:50.806774"], ["updated_at", "2022-10-13 02:53:50.806774"]]

    def toggle_enrollment(user)
        enrollment = Enrollment.find_by(user: user, course: self)
        if enrollment.nil?
            self.new_enrollment(user)
        else
            enrollment.destroy
---
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."user_id" = $1 AND "enrollments"."course_id" = $2 LIMIT $3  [["user_id", 4], ["course_id", 5], ["LIMIT", 1]]
DELETE FROM "enrollments" WHERE "enrollments"."id" = $1  [["id", 1]]

    def enrollment_bool_to_s(user)
        if self.enrollment.find_by(user: user).nil?
---
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."course_id" = $1 AND "enrollments"."user_id" = $2 LIMIT $3  [["course_id", 5], ["user_id", 4], ["LIMIT", 1]]