prototype/high-fedility/app/models/post.rb

SELECT COUNT(*) FROM "awards" WHERE "awards"."post_id" = $1 AND "awards"."award_type" = $2  [["post_id", 5], ["award_type", 1]]
---
    def awards_to_s
        return "Trophies: #{self.awards.where(award_type: 1).count} | Medals: #{self.awards.where(award_type: 0).count}"

SELECT "awards".* FROM "awards" WHERE "awards"."post_id" = $1 AND "awards"."backer_id" = $2 LIMIT $3  [["post_id", 5], ["backer_id", 2], ["LIMIT", 1]]
---
    def award_bool_to_s(user)
        if self.awards.find_by(backer: user).nil?