prototype/high-fedility/app/models/user.rb

UPDATE "users" SET "updated_at" = $1, "activated" = $2, "register_code" = $3 WHERE "users"."id" = $4  [["updated_at", "2022-05-24 01:58:26.309602"], ["activated", true], ["register_code", "204116"], ["id", 2]]
---
    def activate
        self.activated = true
        self.save

UPDATE "users" SET "updated_at" = $1, "activated" = $2, "register_code" = $3 WHERE "users"."id" = $4  [["updated_at", "2022-05-13 05:40:03.694070"], ["activated", true], ["register_code", "155606"], ["id", 1]]
---
    def deactivate
        self.activated = false
        self.save

INSERT INTO "awards" ("user_id", "backer_id", "post_id", "comment_id", "award_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 1], ["backer_id", 2], ["post_id", nil], ["comment_id", 6], ["award_type", 0], ["created_at", "2022-10-18 11:29:12.498444"], ["updated_at", "2022-10-18 11:29:12.498444"]]
---
    def get_award(backer, post, comment)
        award = Award.new
        award.user = self
        award.backer = backer
        award.post = post
        award.comment = comment
        if backer.role_before_type_cast != 0
          award.award_type = 1
        end
        award.save

SELECT "awards".* FROM "awards" WHERE "awards"."user_id" = $1 AND "awards"."backer_id" = $2 AND "awards"."post_id" IS NULL AND "awards"."comment_id" = $3 LIMIT $4  [["user_id", 1], ["backer_id", 2], ["comment_id", 6], ["LIMIT", 1]]
---
    def toggle_reward(backer, post, comment)
        award = Award.find_by(user: self, backer: backer, post: post, comment: comment)

SELECT COUNT(*) FROM "awards" WHERE "awards"."user_id" = $1 AND "awards"."award_type" = $2  [["user_id", 1], ["award_type", 1]]
---
    def awards_to_s
        awards = self.awards.all
        return "Trophies : #{awards.where(award_type: 1).count} | Medals: #{awards.where(award_type: 0).count}"

SELECT COUNT(*) FROM "awards" WHERE "awards"."user_id" = $1 AND "awards"."award_type" = $2  [["user_id", 1], ["award_type", 1]]
---
    def trophies_to_s
        return "Trophies : #{self.awards.where(award_type: 1).count}"

SELECT COUNT(*) FROM "awards" WHERE "awards"."user_id" = $1 AND "awards"."award_type" = $2  [["user_id", 1], ["award_type", 0]]
---
    def medals_to_s
        return "Medals : #{self.awards.where(award_type: 0).count}"